Repository: ilarionkuleshov/marketplace-monitoring-bot
Catalog: src/bot/locales/*/LC_MESSAGES/messages.po
Languages: ru, uk

source: Hello! I'm marketplace monitoring bot. I can help you to monitor adverts on different marketplaces.
ru: Привет! Я бот для мониторинга маркетплейсов. Я могу помочь вам отслеживать объявления на различных рынках.
uk: Привіт! Я бот для моніторингу маркетплейсів. Я допоможу вам відслідковувати оголошення на різних маркетплейсах.

source: Welcome back!
ru: С возвращением!
uk: З поверненням!

source: Available marketplaces:
ru: Доступные маркетплейсы:
uk: Доступні маркетплейси:

source: No active operations to cancel
ru: Нет активных операций для отмены
uk: Немає активних операцій для скасування

source: Operation canceled
ru: Операция отменена
uk: Операцію скасовано

source: You don't have any monitorings yet. Use /new_monitoring to add one.
ru: У вас пока нет мониторингов. Используйте /new_monitoring, чтобы добавить мониторинг.
uk: У вас ще немає моніторингів. Використовуйте /new_monitoring, щоб додати моніторинг.

source: Here are your monitorings:
ru: Вот ваши мониторинги:
uk: Ось ваші моніторинги:

source: 🟢 *Enabled*
ru: 🟢 *Активный*
uk: 🟢 *Активний*

source: 🔴 Disable
ru: 🔴 Деактивировать
uk: 🔴 Деактивувати

source: 🔴 *Disabled*
ru: 🔴 *Деактивирован*
uk: 🔴 *Деактивований*

source: 🟢 Enable
ru: 🟢 Активировать
uk: 🟢 Активувати

source: Never
ru: Никогда
uk: Ніколи

source: Monitoring: *{name}* Status: {status} URL: [*{marketplace_name}*]({url}) Run interval: *{run_interval}* Last run: *{last_run}*
ru: Мониторинг: *{name}* Статус: {status} Ссылка: [*{marketplace_name}*]({url}) Интервал запуска: *{run_interval}* Последний запуск: *{last_run}*
uk: Моніторинг: *{name}* Статус: {status} Посилання: [*{marketplace_name}*]({url}) Інтервал запуску: *{run_interval}* Останній запуск: *{last_run}*

source: 📝 Edit
ru: 📝 Редактировать
uk: 📝 Редагувати

source: 🗑 Delete
ru: 🗑 Удалить
uk: 🗑 Видалити

source: <-- Back to monitorings list
ru: <-- Назад к списку мониторингов
uk: <-- Назад до списку моніторингів

source: Yes
ru: Да
uk: Так

source: No
ru: Нет
uk: Ні

source: Are you sure you want to delete this monitoring?
ru: Вы уверены, что хотите удалить этот мониторинг?
uk: Ви впевнені, що хочете видалити цей моніторинг?

source: Name
ru: Название
uk: Назва

source: URL
ru: Ссылка
uk: Посилання

source: Run interval
ru: Интервал запуска
uk: Інтервал запуску

source: <-- Back to monitoring
ru: <-- Назад к мониторингу
uk: <-- Назад до моніторингу

source: What property do you want to change?
ru: Какое свойство вы хотите изменить?
uk: Яку властивість ви хочете змінити?

source: Enter new name for the monitoring
ru: Введите новое название для мониторинга
uk: Введіть нову назву для моніторингу

source: Enter new URL for the monitoring
ru: Введите новую ссылку для мониторинга
uk: Введіть нове посилання для моніторингу

source: Choose new run interval for the monitoring:
ru: Выберите новый интервал запуска для мониторинга:
uk: Оберіть новий інтервал запуску для моніторингу:

source: Choose the marketplace for monitoring:
ru: Выберите маркетплейс для мониторинга:
uk: Оберіть маркетплейс для моніторингу:

source: Enter search URL on the marketplace to monitor
ru: Введите ссылку поиска на маркетплейсе для мониторинга
uk: Введіть посилання пошуку на маркетплейсі для моніторингу

source: Choose monitoring run interval:
ru: Выберите интервал запуска мониторинга:
uk: Оберіть інтервал запуску моніторингу:

source: Enter monitoring name
ru: Введите название мониторинга
uk: Введіть назву моніторингу

source: Monitoring with this url already exists.
ru: Мониторинг с этой ссылкой уже существует.
uk: Моніторинг з цим посиланням вже існує.

source: Monitoring has been created successfully. Monitoring will start soon. Please note that during the first run of monitoring, you will not receive messages about existing adverts. You will only receive messages about new adverts.
ru: Мониторинг успешно создан. Мониторинг скоро начнется. Обратите внимание, что во время первого запуска мониторинга вы не будете получать сообщения о существующих объявлениях. Вы будете получать сообщения только о новых объявлениях.
uk: Моніторинг успішно створено. Моніторинг скоро почнеться. Зверніть увагу, що під час першого запуску моніторингу ви не отримаєте повідомлень про існуючі оголошення. Ви будете отримувати повідомлення лише про нові оголошення.

source: Something went wrong. Please try again later.
ru: Что-то пошло не так. Пожалуйста, попробуйте позже.
uk: Щось пішло не так. Будь ласка, спробуйте ще раз пізніше.

source: English
ru: Английский
uk: Англійська

source: Russian
ru: Русский
uk: Російська

source: Ukrainian
ru: Украинский
uk: Українська

source: Language (current: {current_language})
ru: Язык (текущий: {current_language})
uk: Мова (поточна: {current_language})

source: Here are the settings:
ru: Вот ваши настройки:
uk: Ось налаштування:

source: <-- Back to settings
ru: <-- Назад к настройкам
uk: <-- Назад до налаштувань

source: Choose new language:
ru: Выберите новый язык:
uk: Оберіть нову мову:

source: {minutes}min
ru: {minutes}мин
uk: {minutes}хв

source: {hours}h
ru: {hours}ч
uk: {hours}год

source: just now
ru: только что
uk: щойно

source: {minutes}min ago
ru: {minutes}мин назад
uk: {minutes}хв тому

source: {hours}h ago
ru: {hours}ч назад
uk: {hours}год тому

source: {days}d ago
ru: {days}дн назад
uk: {days}дн тому

source: Name is required. Please enter a name.
ru: Название обязательно. Пожалуйста, введите название.
uk: Назва обов'язкова. Будь ласка, введіть назву.

source: Name is too long. Please enter a shorter name (max 100 characters).
ru: Название слишком длинное. Пожалуйста, введите более короткое название (максимум 100 символов).
uk: Назва занадто довга. Будь ласка, введіть коротшу назву (максимум 100 символів).

source: URL is required. Please enter a URL.
ru: Ссылка обязательна. Пожалуйста, введите ссылку.
uk: Посилання обов'язкове. Будь ласка, введіть посилання.

source: Invalid URL. Please enter a valid URL.
ru: Неверная ссылка. Пожалуйста, введите правильную ссылку.
uk: Недійсне посилання. Будь ласка, введіть дійсне посилання.

source: URL is too long. Please enter a shorter URL (max 2000 characters).
ru: Ссылка слишком длинная. Пожалуйста, введите более короткую ссылку (максимум 2000 символов).
uk: Посилання занадто довге. Будь ласка, введіть коротше посилання (максимум 2000 символів).
